[{"title": "home based work for all,Imternet marketing,online ad posting", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=6ftwxJ0SWXdzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Dear All,Work profile : To promote tourism on various website by copy the data and paste on website and forward the queries to company.All Can Earn working at Home Using YourComputer , mobiles having Internet, Our Company Offers You Genuine Online ad posting promoteStudents, Fresher s And WorkingProfessionals Basic Computer Knowledge Needed , NoExperience, no target in ad posting .weekly income.Contact at whats appMr.Ravi8929707604Senior Hr", "companyname": "JOY Trip", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Hyderabad/Secunderabad,  Mumbai", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Bpo, Medical Rep, Executive, sales, software engineer, developer, data entry, btech, mba, bcom, bHM, BBA, BSC, BA, computer operator, Housewives, Engineer, IT, Air hostess", "startdate": "", "enddate": "Jul 13, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Lab Technician,Lab Assistant,Laboratory Technician,Lab Incharge", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=n__PLUS__Jn7wikBFlzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Description :1. This position is responsible for the technical and scientific operation of the laboratories under his/her operation.2. The position administers those functions, which results and support in the reporting of laboratory results by planning, monitoring, and appraising functional competency.3. The position is also responsible for enforcement of policies, which assures compliance with standards and accreditation requirements specified by clinical laboratory accrediting agencies such as CAAP/NABL/ISO/State and Central Govt Guidelines.4. The position would ensure the implementation of Quality Management System.5. This position is responsible for the supervision of the Inventory Management and Pilferage Control.6. The position is also responsible for communication with peripheral clients like other Labs, Patients, technicians and management for all operational concerns.7. The position would ensure that personnel employed within the laboratory possess the competence to perform assigned functions and meet educational and training requirements.8. This position is responsible for supervision of technical personnel, to assure that staffing is adequate to competently perform the scope, volume and complexity of testing performed in the laboratories under his/her jurisdiction.9. The position is responsible to assure that the facilities, equipment and working environment are adequate and conducive to the technical & overall working of the clinical reference laboratory.10. The position is that of a leader who regularly communicates with technical personnel, to ensure appropriate staffing, identify potential problems and maintain processes which provide for the effective & efficient review of clinical laboratory test results prior to release.11. The position is responsible to address any complaint, request or suggestion from staff / or users of laboratory services.12. The position is responsible to design and implement a contingency plan to ensure that essential services are available during emergency situations or other conditions when laboratory services are limited or unavailable.13. The position is responsible for executing his/her administrative and managerial duties in an organized manner.", "companyname": "Gita consultant", "location": "Ahmedabad,  Bengaluru / Bangalore,  Hyderabad/Secunderabad,  Kolkata,  Mumbai", "experience": "0 - 1 yrs", "salary": "", "type": "", "skills": "Lab Technician, Lab Assistant, Laboratory Technician, Lab Chemist, Lab Incharge", "startdate": "", "enddate": "May 31, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Draftsman/Draughtsman,Interior Designer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=zdDRiNRJXztzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Draftsman cum Interior DesignerQualification :Diploma Civil / Mech.UG : B.Tech / B.E. Civil / MechExperience : 2 4 yrs experienceJob Description- Drive the design process end to end (including sketching and drafting 2D and 3D are mandatory)- Must be able to prepare construction drawings set and working details set for any architectural project using Autocad, with international standards- Should be able to do the survey of the site, do a detailed differentiated estimation of the quotation to submit in the bank with proper planning and drawings- Fluent in English and Kannada languageSirisha - HR Executive78999 29106/ 93803 82729Anjum J - HR Executive74838 93596/ 85480 32880DISHA Consulting", "companyname": "DISHA Consulting - Recruitment & Executive Search", "location": "Bengaluru / Bangalore", "experience": "2 - 4 yrs", "salary": "", "type": "", "skills": "AutoCAD, Xrefs, dynamic blocks, 3ds max, google SketchUp", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Treasurer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=FHW6mdMyeEBzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Do you want to take your professional career to new heights and truly make a difference? Join our team today. We take on thousands of projects annually, in both local and international locations, so you will have the chance to travel and participate in a wide variety of new challenges. Our company is dedicated to developing innovative solutions. If you are passionate, detail-oriented, and ready to develop unique processes and methods from the ground up, we are excited to work with you.Treasurer Job Responsibilities:Analyzes and recommends optimal capital structure alternatives and roadmap to implementation.Evaluates the companys borrowing capacity and optimal use of debt to finance future growth, focusing on current and future leverage metrics and rating agency implications.Supports and manages financial structure, negotiating and executing financing transactions as needed, including bank facilities, debt financing, lenders, documentation review and covenants.Executes stock repurchase program execution, foreign currency hedging support, and investment management.Ensures Treasury strategies are aligned to support business growth while minimizing risk.Guarantees global banking needs are sufficient to support the business.Develops a strategy and corresponding policies and procedures for the company s global banking structure.Enhances operational efficiency, while minimizing risk and banking fees.Compiles information from around the company to create a routine cash forecasting process, understanding the impact of working capital policies, accounting methods, capital projections, and board authorizations.Creates a strategy and policy for investing cash as appropriate, while ensuring operational flexibility and preservation of capital.Anticipates cash needs and make recommendations to the Executive Staff and BOD for raising funds through the acquisition of debt, sale of stock, or changes in company policies that impact the amount of working capital required to run the business.Manages the credit and collections process.", "companyname": "CORPWIN", "location": "Bengaluru / Bangalore,  Bidar,  Davanagere,  Dharwad,  Gulbarga", "experience": "3 - 8 yrs", "salary": "", "type": "", "skills": "Financial planning and strategy, Strategic planning and vision, Forecasting, Corporate finance, Budget development", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "SEO EXECUTIVE", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=__SLASH____PLUS__m__SLASH__upJq7n9zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Description:-- You will be responsible for managing all SEO activities such as content strategy, link building and keyword strategy to increase rankings on all major search networks. You will also manage all SEM campaigns on Google, Yahoo and Bing in order to maximize ROI.Responsibilities:-- Execute tests, collect and analyze data, identify trends and insights in order to achieve maximum ROI in paid search campaigns Track, report, and analyze website analytics and PPC initiatives and campaigns Manage campaign expenses, staying on budget, estimating monthly costs and reconciling discrepancies. Optimize copy and landing pages for search engine marketing Perform ongoing keyword discovery, expansion and optimization Research and implement search engine optimization recommendations Research and analyze competitor advertising links Develop and implement link building strategy Work with the development team to ensure SEO best practices are properly implemented on newly developed code Work with editorial and marketing teams to drive SEO in content creation and content programming Recommend changes to website architecture, content, linking and other factors to improve SEO positions for target keywords", "companyname": "MailingDataSolutions", "location": "Bengaluru / Bangalore", "experience": "0 - 1 yrs", "salary": "", "type": "", "skills": "Search Engine Optimization, Content Writing, Content Development", "startdate": "", "enddate": "May 30, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Sales Manager,6-9 LPA,Mumbai", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=VZQxHnV5ZqdzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Sales ManagerLocation: Powai,MumbaiRequirements : Immediate joining requiredField : Education Technology. Product is a blockbuster and has shown tremendous conversion potential (20%+) allowing significant upside for a passionate, high-energy growth hackerRoles and Responsibilities - Initiating phone conversations with parents who complete the demo classes for their kids- Intensely following up with the prospects and closing the sales within the sales cycle- Diligently communicating and priming the lead through channels like email, whatsapp, SMS, calls- Achieving the weekly targets in a high pressure performance driven competitive environment- Monitoring self-performance at all times while also contributing to the team performance,keeping track of factors like conversion factor, Average revenue generated per lead, Averagerevenue per sale, etcSirisha - HR Executive78999 29106/ 93803 82729Anjum J - HR Executive74838 93596/ 85480 32880DISHA Consulting", "companyname": "DISHA Consulting - Recruitment & Executive Search", "location": "Bengaluru / Bangalore", "experience": "5 - 7 yrs", "salary": "", "type": "", "skills": "Business Development Client Development Activities, Business Acquisition, Business Development Client Servicing", "startdate": "", "enddate": "Jul 11, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Lead Android Developer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=YH5H59wHv79zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "GrayRipples is looking for Team Lead Android Developement with strong product intuition who care about building software that meaningfully connects with people. We are looking for individuals with strong product intuition who care about building software that meaningfully connects with people. We value engineering excellence alongside a commitment to helping other team members succeed.Apply at the JOBS section in the websiteLeads the requirements acceptance, design, work plan and delivery of new application features.Full understanding of the business requirements, technical design and detailed implementation of the assigned applications and how they work within the enterprise architecture.Can work independently to solve technical issues and mentors other developers in best practices.Continuously advances technical skills and leads the team on the latest software development practices.Works closely with the product owner and business analysts to review and provide feedback on requirements. Provides recommendation on Requirements Acceptance.Responsible for the technical design of a group of features by collaborating with other team members including developers, architects, testers and business analysts.Responsible for the work breakdown of all features with subtasks that are reasonably d and can work with other developers in the delivery of the planned work with high predictability.Responsible for the performance, security and reliability of all application development work.Leads the development team in maintaining accurate work plans for predictable delivery.Leads the team in defining coding standards and ensures they are maintained through consistent code reviews.", "companyname": "Locus IT Services Private Limited", "location": "Bengaluru / Bangalore", "experience": "5 - 8 yrs", "salary": "", "type": "", "skills": "Android Development, Mobile Applications, Mobile Devices", "startdate": "", "enddate": "Jul 11, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Hiring Freshers for Corporate Sales  job @ Bangalore", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=mntVITjBybhzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Hi, we have urgent requirement for Freshers who are interested to work in Sales/marketing field @ Bangalore.* Candidate is willingto do field sales job* Should have excellent communication skills* Meeting different people in market and giving presentations about product* Females who are ready to field sales are more preferable", "companyname": "Live Connections Placements Services Pvt ltd.", "location": "Bengaluru / Bangalore", "experience": "0 - 1 yrs", "salary": "", "type": "", "skills": "MBA, BBA, Freshers", "startdate": "", "enddate": "Jul 11, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Hiring Freshers for US Mortgage process @ BPO, Bangalore", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=UcuRzp5Bd4pzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Hi, We are hiring freshers for one of our client @ Hyderabad.* Finance -2019 passed out freshers are required and candidate have minimum typing speed* Excellent communication skills* Ready to work in complete night shifts* 2 way cab will be provided* Interview mode - telephonic", "companyname": "Live Connections Placements Services Pvt ltd.", "location": "Bengaluru / Bangalore", "experience": "0 - 1 yrs", "salary": "", "type": "", "skills": "Fresher, MBA Finance, B.com", "startdate": "", "enddate": "Jul 11, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Direct Sales Agent", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=Smdz0VFjSXpzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Description:Hard core sales job.Good communication skills must: Clear communication, Good listening, capability to build Patient and humble conversation.Languages:Hindi (Should be able to converse efficiently in Hindi), English(manageable)Role:To call people from the database and enquire whether they need financial services and to provide information regarding the same.To address their queries and to provide them the needed assistance.Incentives:There would be incentives and bonuses based on the number of leads generated.Gender Preference: Looking for female candidates.Minimum Education : 10 th pass .Hiring Process : 1. Telephonic round(introductory) 2. F2F at office premises.Should be ready to relocate to Bangalore .Candidates already located in Bangalore preferred as we need to hire immediately.", "companyname": "TriknTek Software Private Limited", "location": "Bengaluru / Bangalore", "experience": "0 - 1 yrs", "salary": "", "type": "", "skills": "communication, Presentation, Negotiation, hindi, English, Sales", "startdate": "", "enddate": "May 30, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Senior Big Data Engineer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=q6qYUhGuHrdzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Summary As a Big Data Engineer, you will be a member of a small, agile team of data engineers responsible for developing an innovative big data platform as a service for enterprises that need to manage mission critical data and diverse application stakeholders at scale. The platform manages data ingestion, warehousing, and governance, and enables developers to quickly create complex queries. The platform provides automatic scaling and elasticity to enable efficient use of resources, and provides services such as security, logging, and data provenance so that third party developers can focus their energy on algorithms rather than administration. We're looking for engineers who want a technical challenge. Help us improve the platform for our current customers and develop new capabilities for our future customers.Responsibilities Senior Big Data Engineer is an integral part of the Data Science Innovation team that works closely with Internal/External customer in all phases of the development.Work with key stakeholders and understand their needs to develop new or improve existing solutions around data and analytics.Work in a cross-functional, matrix organization, at times under ambiguous circumstances.Partner in development of scalable solutions using large datasets with other data scientists on the teamResearch innovative data solutions to solve real market problems.Conceptualize, analyze and develop actionable recommendations for strategic challenges facing the organization.Manage data analysis to develop fact-based recommendations for innovation projects.Mine Big Data and other unstructured data to tap untouched data sources and deliver insight into new and emerging solutions.Work with cross-functional teams to develop ideas and execute business plans.Remain current on new developments in data analytics, Big Data, predictive analytics, and technology.", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Delhi/NCR", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Java, predictive analytics, Big Data Engineer, Scala, Python, MYSQL, MS SQL, NOSQL, Big Data, Hadoop, c ++, Html, Oracle, Linux, Visual Basic", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Life Insurance Team Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=aCFtVA__SLASH__A1s9zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job HighlightsEligibility Criteria: Any Graduate / Post graduate with good experience in salesMinimum of 2 yrs of experience in sales and sales management,supervision and development of people,Preferably in BFSIMINIMUM / SPECIFIC EXPERIENCE:Required Candidate profileJob descriptionResponsible for:-On Role Team Development {7/8) (Insurance Sales Manager)}Advisor Team Development {7/8) (Insurance Advisor)}Meeting Business goalsKEY RESPONSIBILITIES: Ensure product knowledge by Life Insurance ways of training.Field demonstration (FODs).Work closely with ISM on planning and reviewing of activities and goals.Achievement of monthly, quarterly & yearly business plans.Ensure Company's product mix sales ration and adhere to the business norms.Hold periodical customer meet to understand customers' pulse and product needs.Ensure customer queries are responded to satisfactorily as per Life Insurance standard.Eligibility Criteria: Any Graduate / Post graduate with good experience in salesOTHER RESPONSIBILITIES:HO co-ordinationSales promotion activitiesAssist in overall running of the OfficeExperience- 2 years in SalesMINIMUM/SPECIFIC EXPERIENCE:GraduateMinimum of 2 yrs of experience in sales and sales management, supervision and development of people, Preferably in BFSI.Required Candidate profileWork Experience Required-3-10 yrsJob Location-Amritsar, Chandigarh, Karnal, Hoshiyarpur,Ludhiana, Jalandhar,Karnal, Rohtak, Jammu, Mumbai, Kolkata,", "companyname": "STEPUPFIND", "location": "Bengaluru / Bangalore,  Mumbai,  Jammu,  Bhubaneshwar,  Jalandhar", "experience": "3 - 8 yrs", "salary": "", "type": "", "skills": "Product knowledge, Advisor, Insurance advisor, Planning, Insurance sales, Customer interaction, client handling, Customer queries, Queries, Field demonstration, FODs", "startdate": "", "enddate": "Jul 11, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Azure consultant", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=GuJZtZBH18VzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Azure ConsultantField : Data EngineeringLocation: BangaloreRemote working is subject to lockdownJob Type : ContractualKey Skills : Azure, Data factory, data lake, data engineering, migration from SSIS to ADFAre You The Right Fit For This JOB?- Have you worked with key componentsof Azure data factory/data warehouse/data lake?- Do you have experience with business scenarios of using Azure Data factory/Data warehouse/Data lake- Did you Tune/monitor of particular componentunder Data factory/Data warehouse/data lakeSirisha - HR Executive78999 29106/ 93803 82729Anjum J - HR Executive74838 93596/ 85480 32880DISHA ConsultingBangalore - 560032", "companyname": "DISHA Consulting - Recruitment & Executive Search", "location": "Bengaluru / Bangalore", "experience": "6 - 8 yrs", "salary": "", "type": "", "skills": "Azure, Data factory, data lake, data engineering, migration from SSIS to ADF", "startdate": "", "enddate": "Jul 11, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Manager - Sales - Life Insurance", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=cpUWPL4tACxzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Description :- Building Distribution Network : Build a robust and profitable distribution network of Advisors.- Productivity & Activisation- To Manage productivity and activization of the Advisors within the team.- To promote productivity of the field force.- Establish good working habits for the force, undertake productivity improvement drives, organize specialized training programs.- Recruitment of Agent / Insurance Consultant to ensure growth and productivity.- To evaluate performance & monitor activities for deeper market penetration and improved market share- Take responsibility for scanning the market for emerging opportunities, the presence of competition etc and plans for the progress.", "companyname": "STEPUPFIND", "location": "Bengaluru / Bangalore,  Chennai,  Delhi/NCR,  Hyderabad/Secunderabad", "experience": "5 - 10 yrs", "salary": "", "type": "", "skills": "Life insurance Manager", "startdate": "", "enddate": "Jul 11, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Urdu Personalized Internet Assessor", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=5HnlEy5COoBzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Are you looking for a role that gives you the opportunity to work with one of Americas top 100 most trusted Companies while also increasing your income from the comfort of your home? Then why not join Lionbridge as a part-time Independent Contractor. We are currently recruiting for the role of Personalized Internet Assessor in India.What does the role involve?In this role you will be reviewing online search results in order to improve their content and quality. You will be required to provide feedback and analysis on content found in search engine results and provide ratings on their relevance to the search terms used. Another aspect of this role will involve reviewing the language used in the search results by examining grammar, tone and cultural relevance.Through this work you will be making a valuable contribution by expressing your opinion on the quality and content of what is currently out there on the web. You will play a part in improving the quality of one of the largest search engines in the world using both your PC and required Smartphone device.Who is suitable for this role?We are currently seeking dynamic and creative people who have a strong interest in social media, specifically those who are an active daily user of their Gmail account. We also require suitable candidates to own & use a smartphone Android or iPhone and have a familiarity with other forms of social media and Google products. You should also be flexible, reliable and have the ability to interpret and follow established guidelines.You will have the flexibility and freedom to work from your own home, working your own hours. Hours for this role are a minimum of 10 up to 20 hours per week depending on task availability. We are currently seeking people who have a specific smartphone device (Android V4.2 or higher or iPhone running iOS version 9.0 or higher) to complete tasks. What are the main requirements for the role?You must be fluent in written and verbal English and UrduYou must be living in India for the last 5 consecutive yearsYou must own and use a Smartphone (Android V4.2 or higher or iPhone running iOS version 9.0 or higher) to complete tasksThe majority of the task types will require both a desktop/laptop and a SmartphoneGmail must be your primary email accountActive daily user of Gmail and other forms of social media (Twitter & Facebook)You must have familiarity with current and historical business, media, sport, news, social media and cultural affairs in IndiaAccess to and use of a broadband internet connection and associated computer and software to perform the work, all provided at your own expenseExperience in use of web browsers to navigate and interact with a variety of content Whats next? Don t Delay! Submit your application through the below link using a desktop PC/Laptop:https://goo.gl/oV6HTg A member of our recruitment team will review your application. Please Note: We are unable to offer more than one Personalized Social Media Internet Assessor position per IP address.Only one member per household may apply.", "companyname": "Lionbridge Technologies Pvt Ltd", "location": "Bengaluru / Bangalore,  Delhi,  Delhi/NCR,  Hyderabad/Secunderabad,  Lucknow", "experience": "1 - 5 yrs", "salary": "", "type": "", "skills": "Urdu, English Language, Internet, Web surfing, Smartphone, Android, iPhone, web Browser, Internet Search, online content", "startdate": "", "enddate": "Jul 13, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Oracle Developer,Oracle DBA", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=wt__SLASH__VHu5ackxzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job DescriptionOpportunities for Oracle DevelopersExperience 3- 8 yearsTechnical Skills:o Strong knowledge in Oracle 10g +o Excellent knowledge in SQL, PL-SQLo Strong in Data Warehouse concepts performance optimizations, Validations and exception handlingKnowledge in UNIX will be an advantageKnowledge of ASP . Net is +Other Skills:o Communication skills and presentation skills.o Problem solving ,Multitasking and analytical skillso Certifications in Oracle will be preferred", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Delhi/NCR", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Software Test Engineer, senior test engineer, test lead, test engineer, tester, manual tester, qa tester, manual testing, testing engineer, technical support associate", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Senior Agency Manager - Sales - Insurance", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=ejkdGnMX1AJzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job descriptionJob Role:-Experience : 2 + years of experience in Insurance/ BFSI/ NBFC salesJob description for agency channel in life insurance :- Recruiting a team of On Role Insurance Manager And Off Role financial advisors on commission basis and generate the business.- Monitoring & following process for driving sales through your Team.- Doing Performance Review of your Team- Delivering consistent sales output utilizing your management & monitoring capabilities. Chances for getting 3 promotions with in a year.", "companyname": "STEPUPFIND", "location": "Bengaluru / Bangalore,  Delhi/NCR,  Hyderabad/Secunderabad,  Kolkata,  Mumbai", "experience": "9 - 14 yrs", "salary": "", "type": "", "skills": "Corporate Sales, Insurance Manager", "startdate": "", "enddate": "Jul 11, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Direct Sales Manager - Insurance", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=__PLUS__J0f10U677RzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job description Job Description :- Establishing and strengthening relationship with the allocated customer base.- Selling Insurance policies (ULIP, Term plan, Investment Plans) to current customers.- Converting leads (provided by company) to business.- Revenue Generation.Exp :- 6 Month-10 yrs in direct marketing, life insurance Or Any Sales", "companyname": "STEPUPFIND", "location": "Bengaluru / Bangalore,  Chennai,  Delhi/NCR,  Kolkata,  Mumbai", "experience": "4 - 9 yrs", "salary": "", "type": "", "skills": "Direct Sales, Insurance Sales, Life Insurance Sales", "startdate": "", "enddate": "Jul 11, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Sales Executive/senior Sales Executive - Agency Management", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=wS0AEf48Me1zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Sales Executive/Senior Sales Executive - Agency Management - Life InsuranceJob Opportunity in insurance industry.1) We are hiring for Sales Executive/Sr. Sales Executive for life insurance in banca channel (no field Sales).2) Work closely & jointly with Banc assurance channel partner to generate the life insurance business from Walk in customers of Canara Bank.3) Achieve targets from walk in customers of bank.- Any insurance experience candidate can apply.", "companyname": "STEPUPFIND", "location": "Bengaluru / Bangalore,  Chennai,  Hyderabad/Secunderabad,  Pune", "experience": "5 - 10 yrs", "salary": "", "type": "", "skills": "Channel Sales, Banking Sales, Business Requirements", "startdate": "", "enddate": "Jul 11, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Chief Sr. Agency Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=XsfQKzvB0qNzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Responsible for:-On Role Team Development {10-15) (Insurance Sales Manager)}Meeting Business goalsKEY RESPONSIBILITIES:Ensure product knowledge by Life Insurance ways of training.Field demonstration (FODs).Work closely with ISM on planning and reviewing of activities and goals.Achievement of monthly, quarterly & yearly business plans.Ensure Company's product mix sales ration and adhere to the business norms.Hold periodical customer meet to understand customers' pulse and product needs.Ensure customer queries are responded to satisfactorily as per Life Insurance standard.Eligibility Criteria: Any Graduate / Post graduate with good experience in salesOTHER RESPONSIBILITIES:HO co-ordinationSales promotion activitiesAssist in overall running of the OfficeExperience- 2 years in SalesMINIMUM/SPECIFIC EXPERIENCE:GraduateMinimum of 2 yrs of experience in sales and sales management, supervision and development of people, Preferably in Insurance, BFSI, NBFC, Broking Companies", "companyname": "STEPUPFIND", "location": "Bengaluru / Bangalore,  Chandigarh,  Guwahati,  Bhubaneshwar,  Jalandhar", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Sales Promotion, Team Development", "startdate": "", "enddate": "Jul 11, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Java Developer,Software Engineer,Software Developer,SAP,ABAP", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=ToCJRR6FI1lzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Develop User interfaces for Modern Rich Internet Applications with the latest Front End TechnologiesPerform product analysis and development tasks of increasingly complex nature which may require extensive research and analysis.Writing tested and documented JavaScript, HTML and CSSMake design and technical decisions for AngularJS projects.Develop application code and unit test in the AngularJS, Rest Web Services and Java technologies for the Application Development Center.Ensuring high performanceTest runner framework (Ex. Karma)Hand on and implements complex AngularJS applications, directives, controllers, servicesCritical thinker and problem-solving skillsTeam playerGreat interpersonal and communication skillGood time-management skills", "companyname": "Gita consultant", "location": "Ahmedabad,  Bengaluru / Bangalore,  Hyderabad/Secunderabad,  Kolkata,  Pune", "experience": "0 - 1 yrs", "salary": "", "type": "", "skills": "Linux, C, Java, c ++, Oracle, Html, Javascript, Php", "startdate": "", "enddate": "May 21, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Public Relations Executive", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=PU__PLUS__EnUD4H3BzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "planning, developing and implementing PR strategies;communicating with colleagues and key spokespeople;liaising with, and answering enquiries from media, individuals and other organisations, often via telephone and email;researching, writing and distributing press releases to targeted media;collating and analysing media coverage;writing and editing in-house magazines, case studies, speeches, articles and annual reports;preparing and supervising the production of publicity brochures, handouts, direct mail leaflets, promotional videos, photographs, films and multimedia programmes;devising and coordinating photo opportunities;organising events including press conferences, exhibitions, open days and press tours;maintaining and updating information on the organisation's website;managing and updating information and engaging with users on social media sites such as Twitter and Facebook;sourcing and managing speaking and sponsorship opportunities;commissioning market research;fostering community relations through events such as open days and through involvement in community initiatives;managing the PR aspect of a potential crisis situation.", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Gurgaon", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Public Relations Executive, Public Relations Management, Event Management, Customer, Executive", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Digital Marketing Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=u7TRNtxQ7qZzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "We're currently looking for a proactive, and self-motivated team player to join our digital marketing team as aDigital Marketing Manager.WHAT'S ON OFFER:The opportunity to work with a team of friendly and fun digital marketing veterans based in India and AustraliaJoin an exciting growing company that has doubled revenue Y/YCompetitive Package with Bonus StructureThe most diverse digital marketing role ever! Work on dozens of paid channels including Facebook, Google, Bing, Programmatic, Outbrain, Digital panels, Spotify, Shopify, Squarespace, creating social content and MOREGreat supportive culture eg: Birthday Day Off!WHAT ARE WE LOOKING FOR IN AN APPLICANT?Will have a minimum of 2+ years experience as a Digital Marketing ManagerExcellent written and verbal English skills100% proficient at using the Google Ads and Facebook Ads interfaces including all features e.g: Google Search, Display, Retargeting, YouTube, Instagram, Facebook Lead Form Ads, Lookalike models etcStrong in analytics and data analysis and able to draw valuable commercial insights from the data. You should therefore be able to create high quality presentations using Powerpoint etcAn understanding of the Australian marketing landscape (consumer trends, media channels and key media outlets, partnerships and ecosystems)Certifications Required: Relevant University Bachelor degree e.g: Business, Marketing, Computing etc", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Gurgaon", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Digital Marketing Manager, digital marketing, Google Adwords, Ppc, Adwords, Social Media Marketing, Search Engine Optimization, seo executive", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Resident Construction Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=mx0liMVdWuhzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Designs construction projects by studying project concept, architectural drawings, and models.Prepares engineering design by collecting and studying reports, maps, drawings, blueprints, aerial photographs and tests on soil composition, terrain, hydrological characteristics, and related topographical and geologic data.Determines project costs by calculating labor, material, and related costs.Prepares feasibility study by analyzing engineering design; conducting environmental impact studies; assembling data.Prepares engineering documents by developing construction specifications, plans, and schedules.Confirms adherence to construction specifications and safety standards by monitoring project progress; inspecting construction site; verifying calculations and placements.Fulfills project requirements by training and guiding operators.Maintains operations by enforcing project and operational policies and procedures.Provides engineering information by answering questions and requests.", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Gurgaon", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Civil Building Works, Civil Design, Civil Maintenance, Civil Project, Civil Works, Architect Civil, Civil, Site, Site Maintenance, Site Coordination, Site Manangement", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Industrial Electrician", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=__PLUS__dARurpCNFdzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Rewire faulty electrical systems, such as lighting, heating systems, and alarmsEnsure good quality workmanship which upholds company standards, complies with building codes, and follows safety requirementsWork alone to find and present faults and concerns in electrical systems without receiving explicit directionProvide exceptional customer service and answer any customer questionsInstall electrical systems to 17th edition wiring regulations, including installing heating and cooling systemsProvide professional assessments and advice for customersQualifications and SkillsIndustrial Electrician Skills and QualificationsPrevious Electrical Experience, Lighting, Wiring, Alarm Systems, Fire Prevention Systems, Strong Electrical Maintenance, Customer Service Skills, Risk Assessment, Electrician Apprenticeship, Diagnostics, Fault Finding, Organisation, Valid Driver's License, Initiative, Responsibility, Safety.", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Delhi/NCR", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "cabling, lighting, Fire Alarm, Fire Alarm Systems, fault finding, Fire Protection, Fire Protection Systems, Lighting Distribution, Fire Suppression, Control Systems", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "HVAC Techniciant", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=g0mj6MQdOdJzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Purpose of Position of HVAC Technician: Repair & Maintenance , Preventive Maintenance of AC , Deep Fridge, Cold Rooms & AHUs.1. Preventive & Break down maintenance of HVAC system ,chiller plant & LAF.2. Preventive & Break down maintenance of AC Refrigeration (Split AC, Window AC), Cold rooms & deep fridge. 3. Work related documentation to preventive & break down maintenance of AC & Refrigeration. 4. To ensure compliance as per SOPs statutory and regulations5. Any other assignment as and when decided by the Reporting Manager", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Delhi/NCR", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "hvac, Hvac Systems, Industrial Machinery, Chillers, Piping, Piping Design, Air Conditioning, Chilled Water, Hvac Unit, Hvac Design, Electrical Systems", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Lecturer Mechanical Engineering", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=xmjuxbPoSwpzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "deliver lectures, seminars and tutorialsdesign, prepare and develop courses and teaching materialsdevelop and implement new methods of teaching to reflect changes in researchassess students' courseworkset and mark examinationssupervise students' research activities, including final year undergraduate projects, Masters or PhD dissertationssupervise your own research group, which typically includes research assistants (postdocs), PhD and Master studentssupport students through a pastoral or advisory roleundertake personal research projects and actively contribute to your institution's research profilewrite up research and prepare it for publicationprepare bids to attract funding to your department for a range of research projectscarry out administrative tasks related to the department, such as student admissions, induction programmes and involvement in committees and boardscontribute to professional conferences and seminars in your field of expertiseestablish collaborative links with other institutions, as well as with industrial, commercial and public organisationsparticipate in staff training activities.", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Gurgaon", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Teaching, Examination, Engineering, Manufacturing, Mechanical, Lecturer, professor", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "\"IMMEDIATE HIRING FOR DATA ENTRY SPECIALIST\"", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=zb2__SLASH__UUeZ93tzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Position Offered : Data Entry SpecialistDescription:**** WORK FROM HOME OPPORTUNITYThis is a terrific opportunity for candidates who enjoy back office work and wish to gain experience with a reputable company that offers a supportive and inviting culture. This specialist will be responsible for identifying and fixing discrepancies in the system, as well as entering high volumes of data. A quick typing speed along with high accuracy will be required for this role. A typing assessment will be administered prior to consideration.LOCATION : ANYWHERE IN INDIA Rewards you deserve:Weekly Payouts.Working side by side talented individuals.Career progression opportunitiesFun company thats on the move! Job Role:Back Office work.Non-Voice Back-End Operations.Need to maintain Accuracy in Reports.Good typing and Analytical Skills.Good computer skills and proficiency in Microsoft Word and Excel required.Candidates with prior experience in data entrywill be Preferred.Pre-Requisites:Internet Access(Broadband)Laptop/ Desktop", "companyname": "CYBER PAST CONSULTANTS", "location": "Bengaluru / Bangalore,  Chennai,  Delhi/NCR,  Hyderabad/Secunderabad,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "data entry, data entry operator, back office, ms office, typing, back office executive, ms excel, ms word, excel, Microsoft Word, Microsoft Excel", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Brand Partnerships - Sales", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=RJYS9CVnV__SLASH__9zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "A minimum of 5 - 16 years of work experience with a minimum of 1 year work experience in the digital media space. Open to discussion on designation basis current profile.Experience in understanding content across formats and being able to articulate/ give creative direction to the team for a cohesive output i.e interpret brief from clients to understand brand positioning, key marketing challenge, brand objective and knowing basic execution know- how (duration of activity, budgets available, alignment of resources etc.).Strong hold on both brands and agencies. Should be able to open doors and initiate conversations with all key stakeholders in their respective companies.A track record of having sold large impact campaigns across various digital formats (display, textual advertising, video first, social, IPs, licensing etc.) for blue-chip clients. Owns revenue targets and pushes for them actively. Should be comfortable with owning growth numbers.Will be responsible for driving revenue, growth & customer satisfaction. Provide leadership to the day-to-day operations of the brand partnerships department, while maintaining focus on the company's strategic goals.The ability and agility to switch between tasks and priorities without losing focus or speed. Work with internal teams across content, ad-ops and data to create compelling solutions for clients including rollout plan, budgets, logistics etc.Attention to detail -- in everything. Champions ad-space, properties, and campaigns internally to help drive revenue further.The ability to up-sell to existing clients and to discover new potential brands to collaborate with. Actively pitching to brands and presenting them with creative brand solutions. Monitor, analyze sales, market trends and develop an effective strategic sales planGood to have:The ability to work in a structured manner as the team scales depending equally on processes and on people.Understanding of the display ads space, along with content and innovative business models mentioned above.Keep abreast of developments and trends in digital marketing and content landscape.Needs to have strong contacts and relationships in the industry across clients and agencies which incl. but not limited to Isobar, Reprise media, Resultrix, Performix, GroupM, Omd, Zenithoptimedia, Dentsu, Carat media etc.Having worked on verticals like tech, ecomm, startups, FMCG, F&B, fashion and lifestyle, etc. is an added advantage. Should have the ability to deliver under pressure.", "companyname": "ScoopWhoop Media Private Limited", "location": "Bengaluru / Bangalore", "experience": "5 - 10 yrs", "salary": "", "type": "", "skills": "sales, brand solutions, ad sales, branded content sales, content sales, media sales, b2b sales, corporate sales, brand positioning, brand management", "startdate": "", "enddate": "Jul 11, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Relationship Manager,Relationship Banker,Relationship Officer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=CODT1xIfswlzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "DescriptionExperience of NRI Relationship Manager in a private sector or foreign bankCandidate should be managing around 80 to 100 NRI customers and have a flair for salesCandidate would source a minimum of 5 new NRI relationships every month and also focus on FCNR/NRE/NRO term depositsHe should have a good connectivity in the NRI segment to source business and sound knowledge to understand the businessHe should have cross sell skills for sale of third party products like Life Insurance and Mutual FundsQualificationsAge:Minimum 23 to Maximum 30 years", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Gurgaon", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Bank Audit, Bank Reconciliation, Bank Transitions, Banking Insurance, Banking Process, Banking Products, Banking Software, Auditing Banking Domain, Audits, Clients", "startdate": "", "enddate": "Jul 11, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Hotel Management Executive,Waiter,Chef,Cook", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=5__SLASH__OuG19uwBZzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job description :F & B Hygiene and Work Safety PracticeF & B Basic Service Operation PreparationF & B Guest Service Operation FunctionBeverage Service Operation FunctionFood Service Operation Function ElectiveAlcoholic Beverage PreparationCoffee machine MIS details should be tracked regular basisEnsure all coffee machines are in working condition at all the timeRegisters, records and files should be updated and maintained on a regular basis in all the facilitiesCheck the complaint registers /customers feedback and work accordinglyShould check the daily visit report of supervisorsShould visit sites on a daily basis; He should meet the client and the MOM report to be", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Gurgaon", "experience": "3 - 8 yrs", "salary": "", "type": "", "skills": "Cook, front office, hotel, waiter, reception call services, Receptionist, houskeeping, hotel management, Hotels, Restaurant, Management, food, Nutrition", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Senior Android Developer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=r9OI__PLUS__qzbbnZzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "As digital transformation continues to accelerate, GrayRipples is seeking for Senior Android developers who can support our digital journey. Design and engineer end-to-end experiences that help our clients succeed at the speed of innovation. Be a part of building one of the largest technology and business services firms in the world.Apply at the JOBS section in the websiteDevelop and Manage Mobile Application for Android Platform involving kernel/driver developmentParticipate in S/W product development lifecycle from requirement gathering to feasibility study to suggesting UI//UX flowImplement clean architecture design principles and develop secure and scalable code structureCreate detailed technical documentation with architecture, UI design flows and technical specificationsTranslate designs and wireframes into high quality codeEnsure the best possible performance, quality, and responsiveness of the applicationDesign, build, and test native or hybrid mobile applications for AndroidDesign, build, and test embedded databases and other system data-storesEnsure software meets all requirements of quality, security, extensibility etc.Facilitate application testing and closely monitor the performance for optimizationStay informed of upcoming OS Updates and API enhancements/deprecation to plan compatibility testing and feature enhancementsWorks collaboratively with practice leadership team to grow, develop and enhance solution best practices, tools and methods, and intellectual property.", "companyname": "Locus IT Services Private Limited", "location": "Bengaluru / Bangalore", "experience": "3 - 6 yrs", "salary": "", "type": "", "skills": "Android Development, Mobile Applications, Mobile Devices", "startdate": "", "enddate": "Jul 11, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Hotel Management Executive,Waiter,Chef,Cook", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=pSe5qRJZtoVzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Responsibilities and DutiesVisit Outlets and Get Solve the problems of Existing FranchiseFinding Out Reasons to get increase the sales of outletsHave to achieve monthly or quarterly sales targetsPerson should be very presentable and talkativeRestaurant, Hotel, Outlet Experience/Knowledge would be prefer.Setup New Outlets - Site Visit, Vendors CoordinationLookafter Social Media ChannelsRequired Experience and QualificationsHotel Management Diploma / Course RequiredShould be Self Motivated and Decision MakerPerson should have a bike or two wheelerMust have good knowledge about RestaurantsGood Communication SkillsMS Office, Internet Research", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Gurgaon", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Cook, front office, hotel, waiter, reception call services, Receptionist, houskeeping, hotel management, Hotels, Restaurant, Management, food, Nutrition", "startdate": "", "enddate": "Jul 11, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Network Test Engineer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=HxrcVNZveR5zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job DescriptionRole and Responsibilities Test automation is the primary need Triage test issues for HW/Test versus platform Will also deal with debugging/QA on test results Will automate a bevy of manual tests into a suite 5 of experience in development and scripting roles Support of wireless protocols Understanding of Test methodology Building test test automation from manual test cases Developing: Python Skills (Ruby maybe), SQL Streamlining/optimization of tasks/tests Data modelling experience (normalized & denormalized modells) Code review/debugging Excellent time management and communication ability Must speak and read english well Preferred 12 years experience in development and scripting roles Application development experience Experience is designing distributed computing environments in the public cloud (GCP, AWS or Azure) Wifi, Bluetooth and cellular component knowledge What can Astreya offer you? Working with some of the biggest firms in the world as part of the Astreya delivery network Employment in the fast-growing IT space providing you with brilliant career options for years to come Introduction to the new ways of working and awesome technologies Career paths to help you establish where you want to go A company-wide mentoring program to advise you along the way Online training courses through CBT-nuggets to upskill you Performance management system to provide you with meaningful, actionable feedback Dedicated management to provide you with a point of leadership and care Internal promotion focus. We love to build people from within. Numerous on-the-job perks Peer Recognition Market competitive rates and benefits Astreya Partners is an equal employment and affirmative action employer. We evaluate qualified applicants on merit and business needs and not on race, color, religion, creed, gender, sexual orientation, national origin, ancestry, age, disability, genetic information, marital status, veteran status or any other factor protected by law.", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Delhi/NCR", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Software Test Engineer, senior test engineer, test lead, test engineer, tester, manual tester, qa tester, manual testing, testing engineer, technical support associate", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "HVAC Engineer,HVAC Technician", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=8__PLUS__ac__SLASH__JPVClZzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "B.E. (Mechanical) with 10 to 15 years experience. Salaries and benefits will commensurate with the merits.designing and implementing cost-effective equipment modifications to help improve safety and reliabilitydeveloping a project specification with colleagues, often including those from other engineering disciplinesdeveloping, testing and evaluating theoretical designsdiscussing and solving complex problems with manufacturing departments, sub-contractors, suppliers and customersmaking sure a product can be made reliably and will perform consistently in specified operating environmentsmanaging projects using engineering principles and techniquesplanning and designing new production processesproducing details of specifications and outline designsrecommending modifications following prototype test resultsusing research, analytical, conceptual and planning skills, particularly mathematical modelling and computer-aided designconsidering the implications of issues such as cost, safety and time constraintsworking with other professionals, within and outside the engineering sectormonitoring and commissioning plant and systems.", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Gurgaon", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "HVAC, Hvac Systems, Chillers, Air Conditioning, Cooling, Air Compressor, Heavy Machines, Industrial Machinery, Maintenance, Facilities, Plant, Power System", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Network Applications Engineer,Network Engineer,Hardware Engineer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=g0PWlwmYuG5zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Good knowledge in network conceptsGood knowledge in TCP/IP protocol, OSI layersGood knowledge in firewall configuration and network switches etc.,Good knowledge in switches, router configuration, and backup skillsGood knowledge in DHCP, DNS, WINS, NACLs configurationGood in Internet traffic balancing and shaping", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Delhi/NCR", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Hardware Engineer, system administrator, desktop support engineer, network engineer, senior network engineer, senior engineer, desktop engineer", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Taxation Manager,Tax Advisor,Tax Associate,Tax Auditor", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=p3OIiacxBmRzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "To ensure 100% Statutory Compliance pertaining to ForeignTrade Policy, Customs and DGFTTo ensure timely issuance of an EPCG LicenseTo ensure timely issuance & realization of the MEIS LicenseTo ensure timely compliance of Export ObligationsTo ensure timely availability of EODCsTo ensure timely reply against the queries of DGFT, CustomsLiasioning with outside agencies i.e. DGFT, Customs, FIEO, FICCIAnalysis of various Customs & Foreign Trade Policies andProcedure Notifications & to apprise the ManagementMaking Representation with Customs, DGFT, FIEO, FICCI etc.Coordination with IT for Developments initiatives in SAPTo ensure 100% Compliance pertaining to the Organizational Policy, Guidelines, Initiatives", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi/NCR,  Gurgaon", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Tax Audit, Tax Audits Income Tax, Tax Compliance, Tax Cost Audit, Tax Planning, Funding, Legal, Tax, Financial, Advance Corporate Tax, Company Tax Issues, Bookeeping", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "SEO Specialist,Content Developer,Web Content Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=qS5fAxhV54JzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Website marketing executive who has knowledge as following :1. Built website promotion strategy2. onpage / offpage website promotion3. link building where required4. Good Social media knowledge5. SEM expert6. PPC, Adwords and others SPECIALIZATION:Marketing Strategy,Digital marketing,Digital marketingROLE:Online/ Internet Marketing - Executive/ Manager, SEO/ Online Advertising - Executive/ Manager , Other Marketing", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi/NCR,  Gurgaon", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Web Designing, software developer, Html, Xml, Javascript, Html5, Css3, Wordpress, Php, Css, Photoshop, Flash, Content Development, Technical Writing, Content Writing, SEO", "startdate": "", "enddate": "Jul 11, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Software Test Engineer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=ChHT22DjTBNzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Purpose of the job:As a Software Test Engineer you will be involved in systems and products development included in the ETCS/ERTMS onboard solutions and support in the adaptation and application of Bombardier ERTMS products.Key responsibilities:- Prepare Test Plans in order to verify and ensure that the system meets its design specifications and requirements within the project.- Write Test Specification, Test Environment Specification, Test Record and Test Reports.- Develop and execute test cases and related scripts for scenario-based testing in lab environment.- Analyse test results and reported deviations from expected system behaviour.- Support lab configuration setup according to technical specifications.- Plan, coordinate and support of System Integration activities.- Support Project Management, Project Engineering and System Engineering.- Re-create, analyse and suggest potential solutions of reported errors.- Interface with several internal departments, suppliers and customers.- Participates in technical document reviews and prepare documents for submission to the customers and suppliers.Qualifications- Bachelors or masters degree in Electrical/Electronic, Transportation, Automation, IT or equivalent work experience.- Relevant previous experience in system integration, testing and writing documentation in development projects.- Good understanding of HW and SW interactions within complex system architectures.- ISTQB/ISEB Certification is an advantage- Experience of ERTMS or other safety-critical systems is highly valued.- Knowledge of job-specific tools (C, C , C #, Linux, VectorCAST) is desirable.- English language skills required, other European language, such as German or French, represents an advantage to the role.", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Delhi/NCR", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Software Test Engineer, senior test engineer, test lead, test engineer, tester, manual tester, qa tester, manual testing, testing engineer, technical support associate", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Brand Manager,Brand Planner,Brand Specialist", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=j0JAPpxKFZtzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Looking for an energetic self-starter with a consultative marketing approach who is pro-active in driving revenue and increasing the client base.Strong written and verbal skills and be highly proficient in building and presenting recommendationsA creative thinker with excellent customer service and organization skills; and the ability to build strong relationships and exercise excellent follow-upTaking care of branding activities of our products in different sectors/IndustriesCarrying out activities/seminars/presentations/workshops in various exhibitions, events and open house to promote the awareness or brand of our productsTravel across in the given region/territoryFollow up with existing clients for queries related to the product functionally & regular follow up with new clients till the appointments/ meetings are fulfilled.", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Gurgaon", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "brand, Product Management, brand management, Market Research, Marketing Strategy, Branding, Promotion, Marketing, business development manager, bde, business analyst", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Civil Project Engineer,Civil Site Engineer,Civil Draftsman", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=saEuvdPVFRVzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Act as the main technical adviser on a construction site for subcontractors, craftspeople and operativesSet out, level and survey the siteCheck plans, drawings and quantities for accuracy of calculationsEnsure that all materials used and work performed are in accordance with the specificationsOversee the selection and requisition of materialsAgree a price for materials and make cost-effective solutions and proposals for the intended projectManage, monitor and interpret the contract design documents supplied by the client or architectDay-to-day management of the site, including supervising and monitoring the site labour force and the work of any subcontractors", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Gurgaon", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Civil Building Works, Civil Design, Civil Maintenance, Civil Project, Civil Works, Architect Civil, Civil, Site, Site Maintenance, Site Coordination, Site Manangement", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Solutions Engineer,Senior Solutions Engineer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=0d84DUd3C9tzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Leverage best in class technologies to convert the use cases/requirements into test design, automation scripts and its implementation, test/build deployment and support.Work as part of a collaborative team surrounded by passionate, fun-loving talented engineers who help deliver quality features with efficiencyBe part of a dynamic and fast-growing team delivering strategically important solutions for world-class customers.Who You Are:You are a good team player and work collaboratively, enthusiastic and passionate about exploring, come join us in building quality applications that solve real business problems.Good verbal and written communication skills, including poise in pressure situations while being a team playerAbility to effectively articulate technical challenges and solutionsAble to think forward and understand the healthcare domain and how technology can be used to make it betterWhat You've Accomplished:Bachelor of Engineering or Bachelor of Technology with good academic record2 - 3.5 years of experience working as Developer or ProgrammerStrong OO programming experienceHealthcare Domain expertise is mandatoryPartner with internal clients, like Product Managers/ platform teams, to align business goals with quality results.", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Gurgaon", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Software Test Engineer, senior test engineer, test lead, test engineer, tester, manual tester, qa tester, manual testing, testing engineer, technical support associate", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "BPO,KPO,Customer Support,Customer Service Executive", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=gnl89XjWoAZzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "a) Candidates Need to Answer the Inbound International Callsb) Need to Provide the Resolution Over the Phonec) Should have Good Communication Skillsd) Must Be Comfortable in Night Shift/earlyMorning Shiftqualifications:-fluent English-candidates from Convent Schools are Proffered-available in Night Shifts to Work-focused and Calm in Nature.", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Gurgaon", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "BPO, Kpo, Call Center, Customer Care, customer care executive, call coordinator, helpdesk executive, team leader, service manager, Back Office, Customer, Executive", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "It Project Manager,Assistant Manager Technology,General Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=of9U7W6a8D1zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "2+ years of experience including Project Management experience managing teams, deliverables, client relationship etc. Need to work as part of Client's Leadership Team and review, analyse and report following deliverables :1. Project Plan2. Estimates3. Efforts4. Delivery reports5. SLA compliances- Need Review and/or identify the team who can review and generate reports on the Dev and QA solutions, methodology, processes etc.- Participate in meetings with stakeholders from State as required by Client and report the minutes/findings/analysis- Prepare and analyse various reports, dashboards as requested by the client- Provide guidance, support to team members on the project as and when needed- Send periodic Status Reports to Client and to internal Leadership as required/defined by Client and internal Leadership- Identify the avenues for value addition and business development for the organization.", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Gurgaon", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "It Project Manager, Program Management, Project, Program, Delivery Management, Project Controlling, Project Coordination, Project Executive, senior engineer, J2EE, Java", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Immediately Looking for Manual Test Engineer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=ehAMfxvAmQ5zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Responsible in Installations of platforms & applications, preparing Test plans.Responsible in Test Case Design and execution of test cases with the help of Strategy Document.Modifying the test cases when change in the requirements.Executing test iterations, tracking/reporting results, troubleshooting, and coordinating defect resolution.Involved in understanding and analyzing Project requirement documents.Good in Functional Testing, Regression Testing, API Testing, GUI Testing.Should have good knowledge on Database and SQL queriesKnowledge of web services testing (REST API)Performing integration testing of multiple products in Web, desktop, mobile, and multi-platform application environment.Document, implement, monitor, and enforce all processes for testing as per standards defined by the organization.Keep track of the new requirements/ change in requirements of the Project.Ability to handle multiple assignments simultaneously.Should be a self-starter and capable of operating on minimal management oversight.Ability to work under pressure to meet agreed deadlines.Should be a team player and willing to take ownership.Should be accountable for the assignments.", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Delhi/NCR", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Software Test Engineer, senior test engineer, test lead, test engineer, tester, manual tester, qa tester, manual testing, testing engineer, technical support associate", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Teacher (Mathematics)", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=__PLUS__N03Pgb7kxZzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Skill-Knowledge ofMathematicsTeaching Strategies. Students learn in different ways,A Personable ApproachClassroom LeadershipCare and ConcernQualification- Any graduationSalary-3-10 Lacs(depend on performance)Job Description Math teachers actively instruct students, create lesson plans, assign and correct homework,Manage students in the classroom, communicate with parentsHelp students prepare for standardized testing. Math teacher job duties can vary significantly between elementary school and higher grade levels. Need to help students prepare for graduation and college entry exams, while in elementary schools the mastery of basic skills is of paramount importance.Notes- First upload your resume on given website after that we will arrange your interview.Website-www.grouproyal.co(.)in ;", "companyname": "COFIDENTIAL", "location": "Bengaluru / Bangalore,  Mangalore,  Mysoru / Mysore,  Cochin/ Kochi/ Ernakulam,  Thiruvananthapuram", "experience": "0 - 2 yrs", "salary": "", "type": "", "skills": "Programming, Teaching, Professor, Engineering", "startdate": "", "enddate": "Jul 11, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Medical Coder,Nursing,Dentist,Genetics", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=lJjXpZ5D6IdzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Description:Designation : Medical Coder Trainee/ Medical Coder / Sr . Medical Coder/Team leader/ Medical Coding AnalystSpecialization : Surgery/Observation/ E&M/ In_Patient/ Out Patient/Multi specialty/ EDRequirement :Fresher in Medical Coding (or)Knowledge in Anatomy and Physiology.Must possess Good Written & Verbal SkillsBasic Computer Skills.Eligibility:Any Life Science, Paramedical, Medical Graduates and Post Graduates (Pharmacy, Physiotherapy, Nursing, , Biotechnology, Plant Biology, Biology, Bio-Medical graduates, Zoology, Botany, Bioinformatics, Genetics, B.O.T, Microbiology, Biochemistry ,Endocrinology, Nutrition & Dietetics, Anatomy, Physiology , Chemistry, Medical Lab Technology, Health Education, M.B.B.S, B.D.S, B.H.M.S, B.A.M.S, etc.)Salary : Negotiable (Incentives & Benefits as per Corporate Standards)Hiring Process :Face to Face Interview, Telephonic InterviewBenefits:1. Pick Up & Drop Facility2. Food Facility3. Day Shift4. Easily Accessible to Job5. Weekend OffCareer Growth:Excellent opportunity to enhance your career by getting CPC(Certified Association of Professional Coders) and AHIMA(American Health Information Management Professional Coders) and CCS(Certified Coding Specialist) Certification from AAPC(American Association) respectively.", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Gurgaon", "experience": "3 - 8 yrs", "salary": "", "type": "", "skills": "Pharma, Pharmaceutical, Medical Transcription, biochemistry, nursing, Healthcare, Healthcare Management, Healthcare Industry, gnm, anm, Medical Billing, anaesthesia", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "IT Program Manager,Program Coordinator", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=5imUZsn1I6hzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job ResponsibilitiesAccomplishes strategic objectives by overseeing multiple project activities.Manages human resource goals by recruiting, training, coaching, and disciplining employees.Communicates job expectations by planning, monitoring, appraising, and reviewing job contributions.Plans and reviews compensation actions and enforces policies and procedures.Achieves operational objectives by contributing information and recommendations to strategic plans and reviews and preparing and completing action plansImplements production, productivity, quality, and customer-service standards by resolving problems, completing audits, identifying trends, determining system improvements, and implementing change.Meets financial objectives by preparing an annual budget, scheduling expenditures, analyzing variances, and initiating corrective actions.Enhances department and organization reputation by accepting ownership for accomplishing new and different requests and exploring opportunities to add value to job accomplishments.", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi/NCR,  Gurgaon", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "IT Application Programming, Legacy System, Sql, Java, Oracle, C, Html, Css, Ajax, Javascript, Php, Wordpress, Magento, Codeigniter, Jquery, Json, Xml Parsing, Sqlite, Android", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Software Test Engineer,Test Engineer,Senior Test Engineer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=oFGAkLBZI4VzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Typical duties include:creating a test planusing the plan to assess functionality, performance, reliability, stability and compatibility with other systemsusing the plan to hunt down and fix software bugslooking for ways to prevent bugs from occurring in the first placeguarding against incorrect language usage, truncated text and incorrect formattingensuring the product is culturally compatible with the target marketsome localization analysts are responsible for translation workrebuilding the corrected software application.Other responsibilities include:Develop test plans, test cases, test scripts and test reports on multiple projects of varying .Perform testing on various software, telecom and reporting systems.Validate that user expectations are achieved during the testing process.Review user requirements documents to ensure that requirements are testable.A candidate is responsible for Website testing, I-phone application testing, Android application testing, and Another application testing.Responsible for making a bug report.Should possess sound database knowledge.Required Experience, Skills and QualificationsKnowledge of a broad range of software applications and of hardware and networksGood knowledge of SDLC, Software Testing Life Cycle (STLC) and different testing methodologiesGood knowledge of agile methodology (Scrum Technique)Well versed with Usability, GUI, Functional, System, Regression and Smoke/Sanity testingTesting experience on web and mobile applications is preferredStrong programming knowledgeA good understanding of businessAbility to think in the abstract and see how small details fit into the bigger pictureA creative mindset and the ability to approach a problem creativelyGood communications skills, both written and verbalStrong IT skillsA meticulous approach to workAbility to use logic and reasoning to identify the strengths and weaknesses of IT systems", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Delhi/NCR", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Software Test Engineer, senior test engineer, test lead, test engineer, tester, manual tester, qa tester, manual testing, testing engineer, technical support associate", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}, {"title": "Product Manufacturing Engineer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=0SyqHmIDHrxzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Responsibilities:Interfaces with Engineering functions to coordinate the release of New Products or/and product improvements. Owns Module/Product on PLC/CIP ProgramLaunches, releases, approves, and implements engineering change orders as required to support design engineering and floor for new/existing products. Owns SMBOM Release to support Phase exitsAbility to process Non Standard request (BOM) for Systems and NSOSupports New Product documentation by OMS Creation for NPI/CIP BuildsCreates/maintains Master layout in UG/NX (Models of New Products)Develops project methodology and/or project proposals.Participates in preparation of concept and feasibility studies.Interfaces between operations, design engineering & Global Product management to implement most feasible solution.Makes recommendations for tooling and process requirements. Uses DFx principles to reduce manufacturing and/or product costs and improve delivered product quality.Participates in New Product Builds & Champions issue resolution. Determines root cause analysis for issues that arise during assembly and/or test of systems; provides Long term corrective action.Engage with Volume Manufacturing Engineers, New Product Manufacturing Engineers, NPT PMs, Materials, Manufacturing Techs and Suppliers to transition from NPI operations to Volume ManufacturingHas extensive knowledge of Design / Manufacturing Process, best known methods, procedures and policies.Participates in the development and maintenance of new business processes; edits as necessary to ensure current practices are documentedPerforms other duties as assigned. Duties will vary according to the project in progress and/or the specific goals of the department in which the incumbent works.Job Specific KnowledgeRequires demonstrated knowledge of manufacturing engineering discipline, theories, practices and principles.Requires knowledge necessary to perform the job function such as an understanding of the engineering change order process, DFx (Design for Excellence) engineering principles, product development process, value engineering, engineering specification waiver process, Producibility / manufacturability analysis, product structure, bill of materials, product safety requirements, material handling, and root cause analysis.One should have demonstrated the knowledge on the products, configurations, Team Center and Options & Variants.Hands on Experience in creation and Maintenance of New Options & providing Variant Conditions.Skills:Requires strong skills in Product technology, Change management, problem solving, communication skills, customer orientation, personal effectiveness, team skills, and quality.In depth knowledge of CAD tools (UG-NX & Team center), SAP BOM & ECO is a mustRequires additional knowledge of systems and software necessary such as MS Word, Excel, PowerPoint, Flowcharting, FRACAS, and/or BRIO.", "companyname": "Electro devices pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Delhi/NCR", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "manufacturing engineer, corrective action, safety, manufacturing, Industrial, Mechanical, Safety Engineering, Fire Safety, Industrial Safety, Accident Investigation", "startdate": "", "enddate": "Jul 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1589412007.6239445}]